#!perl -w

use strict;
use Test;
use lib qw(../../ ../);
use CodeWorks;

BEGIN { plan tests => 16, todo => [14, 15, 16] }

use vars qw( $input $output $expected );

#== 1 ======================================================

$input = <<EOF
Перем Приветствие;

Функция МояФункция1()
	Возврат 1;
КонецФункции // МояФункция1

Функция МояФункция2()
	Возврат 2;
КонецФункции // МояФункция2

Приветствие = "Привет, Мир!";
Сообщить(Приветствие);
EOF
;
@CodeWorks::lines = split(/\n/, $input, -1);
ok(CodeWorks::FindProc("МояФункция1"), 1);
ok($CodeWorks::proc_start, 2);
ok($CodeWorks::proc_end, 4);

ok($CodeWorks::proc_body, "Функция МояФункция1()\n\tВозврат 1;\nКонецФункции // МояФункция1");

ok(CodeWorks::FindProc("МояФункция2"), 1);
ok($CodeWorks::proc_start, 6);
ok($CodeWorks::proc_end, 8);

#== 2 ======================================================

$input = <<EOF
Перем Приветствие;

Функция МояФункция() Далее
Процедура МояПроцедура Далее

Функция МояФункция()
	Возврат 1;
КонецФункции // МояФункция()

Процедура МояПроцедура()
	Возврат 2;
КонецПроцедуры // МояПроцедура()

Приветствие = "Привет, Мир!";
Сообщить(Приветствие);
EOF
;
@CodeWorks::lines = split(/\n/, $input, -1);
ok(CodeWorks::FindProc("МояФункция"), 1);
ok($CodeWorks::proc_start, 5);
ok($CodeWorks::proc_end, 7);

ok(CodeWorks::FindProc("МояПроцедура"), 1);
ok($CodeWorks::proc_start, 9);
ok($CodeWorks::proc_end, 11);

#== 3 ======================================================
# TODO стоит ли вообще рассматривать такие варианты?
# встречаются в основном в C++ классах. Наверное,
# о таких случаях просто следует оговориться в документации.
$input = <<EOF
Перем МояПерем;

Функция МояФункция() Возврат 1; КонецФункции // МояФункция()

Процедура МояПроцедура()
	Возврат 2;
КонецПроцедуры // МояПроцедура()

EOF
;
@CodeWorks::lines = split(/\n/, $input, -1);
ok(CodeWorks::FindProc("МояФункция"), 1);
ok($CodeWorks::proc_start, 2);
ok($CodeWorks::proc_end, 2);
              	