#!perl -w

use strict;
use Test;
use lib qw(../../ ../);
use CodeWorks;

BEGIN { plan tests => 6 }

use vars qw( $input $output $expected );

#== 1 ======================================================

$input = <<EOF
Перем МояПеременная;

Процедура МояПроцедура(Арг)
	Перем П1, П2, П3;
	П3 = П1 + П2;
	Арг = П3 / МояПеременная;
КонецПроцедуры // МояПроцедура()

МояПеременная = 2;
EOF
;
$expected = <<EOF
Перем Делитель;

Процедура МояПроцедура(Арг)
	Перем П1, П2, П3;
	П3 = П1 + П2;
	Арг = П3 / Делитель;
КонецПроцедуры // МояПроцедура()

Делитель = 2;
EOF
;
@CodeWorks::lines = split(/\n/, $input, -1);
ok(CodeWorks::RenameObject("", "", "МояПеременная", "Делитель"), 1);
$output = join("\n", @CodeWorks::lines);
ok($output, $expected);

#== 2 ======================================================

$input = <<EOF
Перем МояПеременная;

Процедура МояПроцедура(Арг)
	Перем П1, П2, П3;
	П3 = П1 + П2;
	Арг = П3 / МояПеременная;
КонецПроцедуры // МояПроцедура()

МояПеременная = 2;
EOF
;
$expected = <<EOF
Перем МояПеременная;

Процедура МояПроцедура(Арг)
	Перем П1, П2, П3;
	П3 = П1 + П2;
	Арг = П3 / Арг;
КонецПроцедуры // МояПроцедура()

МояПеременная = 2;
EOF
;
@CodeWorks::lines = split(/\n/, $input, -1);
ok(CodeWorks::RenameObject("", "МояПроцедура", "МояПеременная", "Арг"), 1);
$output = join("\n", @CodeWorks::lines);
ok($output, $expected);

#== 3 ======================================================

$input = <<EOF
Перем МояПеременная;

Процедура МояПроцедура(Арг)
	Перем П1, П2, П3;
	П3 = П1 + П2;
	Арг = П3 / МояПеременная;
КонецПроцедуры // МояПроцедура()

Функция МояФункция()
	Перем А;
	А = МояПеременная;
	МояПроцедура(А);
	Возврат А;
КонецФункции // МояФункция()

МояПеременная = 2;
EOF
;
$expected = <<EOF
Перем МояПеременная;

Процедура ТестПроц(Арг)
	Перем П1, П2, П3;
	П3 = П1 + П2;
	Арг = П3 / МояПеременная;
КонецПроцедуры // ТестПроц()

Функция МояФункция()
	Перем А;
	А = МояПеременная;
	ТестПроц(А);
	Возврат А;
КонецФункции // МояФункция()

МояПеременная = 2;
EOF
;
@CodeWorks::lines = split(/\n/, $input, -1);
ok(CodeWorks::RenameObject("", "", "МояПроцедура", "ТестПроц"), 1);
$output = join("\n", @CodeWorks::lines);
ok($output, $expected);
